Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods
This class defines extension methods for type conversions between
Open API Geometry3d types and Tekla.Common.Geometry types.

Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods.ToPoint(Tekla.Common.Geometry.Vector3)
Extension method for creating a point out of Vector3.
vector3: Vector3 to be converted.
Returns: Point created from Vector3.

Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods.ToVector3(Tekla.Structures.Geometry3d.Point)
Extension method for creating a Vector3 out of Point.
point: Point to be converted.
Returns: Vector3 created from point.

Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods.ToUnitVector3(Tekla.Structures.Geometry3d.Vector)
Extension method for creating a UnitVector3 out of Vector.
vector: Vector to be converted.
Returns: UnitVector3 created from vector.

Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods.ToVector(Tekla.Common.Geometry.UnitVector3)
Extension method for creating a Vector out of UnitVector3.
unitVector3: UnitVector3 to be converted.
Returns: Vector created from UnitVector3.

Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods.ToUnitVector3Array(Tekla.Structures.Geometry3d.Vector[])
Extension method for creating a UnitVector3 array out of Vector array.
vectors: Array of vectors to be converted.
Returns: Array of UnitVector3 converted from array of Vectors.

Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods.ToPointArray(System.Collections.Generic.IEnumerable{Tekla.Common.Geometry.Vector3})
Extension method for creating a Point array out of Vector3 IEnumerable.
vectors3: Vector3 IEnumerable to be converted.
Returns: Array of Points converted from Vector3 IEnumerable.

Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods.ToLine3(Tekla.Structures.Geometry3d.Line)
Extension method for creating a Line3 out of Line.
line: Line to be converted.
Returns: Line3 created from line.

Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods.ToSegment3(Tekla.Structures.Geometry3d.LineSegment)
Extension method for creating a Segment3 out of LineSegment.
lineSegment: LineSegment to be converted.
Returns: Segment3 created from LineSegment.

Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods.ToLineSegment(Tekla.Common.Geometry.Segment3)
Extension method for creating a LineSegment out of Segment3.
segment3: Segment3 to be converted.
Returns: LineSegment created from Segment3.

Tekla.Structures.Geometry3d.CommonGeometryExtensionMethods.ToPlane3(Tekla.Structures.Geometry3d.GeometricPlane)
Extension method for creating a Plane3 out of GeometricPlane.
geometricPlane: GeometricPlane to be converted.
Returns: Plane3 created from GeometricPlane.